Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ནམ་མཁའ་དེ་ཐོས་པ་དང་ཡིད་མཆོག་ཏུ་དགའ་སྟེ། བདག་ཉིད་ཀྱིས་བྲམ་ཟེ་ཁྲུས་བྱས་ནས་རྒྱལ་ཐབས་ཀྱི་ཐོད་བཅིངས་ཏེ། རྒྱལ་པོའི་དབང་བསྐུར་བས་དབང་བསྐུར་ནས།
en: When King Ambara heard this, his mind was filled with joy, and he himself washed the brahmin, bound the turban on his head, and consecrated him as the king.

source: རྒྱལ་སྲིད་ལ་རབ་ཏུ་བཞག་སྟེ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཕུལ་ནས་སྨོན་ལམ་བཏབ་པ། བདག་གིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: Leaving behind his kingship, and having given away the entirety of Jambudvīpa, he prayed, ‘May I attain the complete enlightenment of perfect buddhahood because I have given away the entirety of Jambudvīpa!

source: གལ་ཏེ་བདག་གི་རེ་བ་དེ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། གང་བདག་གིས་ད་ལྟར་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྒྱལ་པོར་བཅུག་པ་འདི་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་ཚིག་གིས་དབང་སྒྱུར་ཞིང་ཚེ་རིང་བ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་ཡུན་རིང་དུ་གནས་པར་གྱུར་ཅིག །
en: If this wish of mine is to be fulfilled, then may the one I have now made the king of all Jambudvīpa command the whole of Jambudvīpa, have a long life, and be a cakravartin for a long time.

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ་རྒྱལ་ཚབ་ཉིད་དུ་གྱུར་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་ཡང་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: When I attain the complete enlightenment of perfect buddhahood, may he be my regent and receive the prophecy of his attainment of the highest, most complete enlightenment.’ “

source: །བྲམ་ཟེ་འདོད་པ་ཞེས་བྱ་བ་དེས་ཀྱང་ངའི་རྐང་པ་གཉིས་བསླངས་པ་དང་ང་ཉིད་ཀྱིས་སེམས་རབ་ཏུ་དང་བས་མཚོན་ཆ་རྣོན་པོ་བླངས་ནས།
en: Then a brahmin named Roca asked me for my feet, and with delight I took a sharp sword, cut off my own feet, and gave them to him.

source: རང་གི་རྐང་པ་གཉིས་བཅད་དེ་བྱིན་ནས་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་རྐང་པ་ཐོབ་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: I made the prayer, ‘May I obtain the feet of unsurpassable correct conduct.’ “

source: །དེ་ན་བྲམ་ཟེ་ལྟ་བ་སྲུང་ཞེས་བྱ་བ་དེས་ཀྱང་ངའི་མིག་གཉིས་བསླངས་པ་དང་།
en: A brahmin named Drāṣṭāva asked me for both my eyes.

source: ངས་མིག་གཉིས་ཕྱུང་སྟེ་དེ་ལ་བྱིན་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། བླ་ན་མེད་པའི་སྤྱན་ལྔ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ།
en: I pulled out both eyes and gave them to him and, as before, made a prayer for the attainment of the five unsurpassable eyes. “

source: །ཡང་རིང་པོ་མ་ལོན་པར་བྲམ་ཟེ་སྒྲ་བཟང་ཞེས་བྱ་བ་དེས་ཀྱང་ངའི་རྣ་བ་གཉིས་བསླངས་པ་དང་།
en: Not long after, a brahmin named Saracchighoṣa asked me for both of my ears.

source: ང་ཉིད་ཀྱིས་རང་གི་རྣ་བ་གཉིས་བཅད་དེ་དེ་ལ་བྱིན་ནས་བླ་ན་མེད་པའི་སྙན་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ།
en: I cut off both of my ears and gave them to him and prayed for the unsurpassable ears. “

source: །འཚོ་བ་པ་ཡང་དག་འཚོ་ཞེས་བྱ་བ་དེས་ཀྱང་ངའི་སྐྱེས་བུའི་དབང་པོ་ཕོ་མཚན་བསླངས་པ་དང་།
en: An ājīvika named Saṃjīvana asked me for my genitalia.

source: ང་ཉིད་ཀྱིས་བཅད་དེ་བྱིན་ནས་མདོམས་ཀྱི་སྦ་བའི་མཚན་བླ་ན་མེད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ།
en: I cut them off, gave them to him, and prayed for the unsurpassable great being’s feature of a penis concealed within the abdomen. “

source: །གཞན་དག་གིས་ཀྱང་ངའི་ཤ་དང་ཁྲག་དག་བསླངས་པ་དང་། ང་ཉིད་ཀྱིས་བྱིན་ནས་གསེར་གྱི་མདོག་ལྟ་བུའི་མཚན་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ།
en: Others asked me for my flesh and blood, and I gave it to them and prayed for the sign of a golden complexion. “

source: །གཞན་ཡང་ཀུན་དུ་རྒྱུ་འོ་མ་འཛག་ཅེས་བྱ་བ་དེས་ངའི་ལག་པ་གཉིས་བསླངས་པ་དང་།
en: Also, a mendicant named Kṣīrasa asked me for both my hands.

source: ང་ཉིད་ཀྱིས་ལག་པ་གཡས་པས་ལག་པ་གཡོན་པ་བཅད་ནས་གཡས་པ་ཡང་གཅོད་དུ་བཅུག་སྟེ་བྱིན་ནས་དད་པའི་ཕྱག་བླ་ན་མེད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་བཏབ་བོ།
en: I cut off my left hand with my right hand and then had my right hand cut off. I gave them to him and prayed for the unsurpassable hands of faith. “

source: །གང་གི་ཚེ་ངས་ཡན་ལག་དང་ཉིང་ལག་དག་བཅད་པ་དེའི་ཚེ་ལུས་ཁྲག་གིས་ཡོག་བཞིན་དུ་སྨོན་ལམ་བཏབ་པ། གལ་ཏེ་ཡོངས་སུ་གཏོང་བ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་བདག་གི་ལུས་ཀྱི་ལེན་པ་ཞིག་ཀྱང་གདོན་མི་ཟ་བར་རྙེད་པར་གྱུར་ཅིག །དེ་ན་སེམས་ཅན་རྣམས་དང་།
en: When my limbs and the smaller parts of my body were cut off, covered with blood, I prayed, ‘If through this generosity my aspiration for the highest, most complete enlightenment will be fulfilled, may I definitely have someone who will take this body.’ “

source: ཁམས་ཀྱི་རྒྱལ་པོ་རྣམས་དང་། བློན་པོ་དེ་དག་ཀྱང་སྙིང་རྗེ་མེད་ལ། འཕགས་པ་མ་ཡིན་ཞིང་། བྱས་པ་མི་གཟོ་བས་སྨྲས་པ། འདི་ནི་བློ་འཆལ་ཅིང་ཤེས་པ་ཆུང་སྟེ།
en: Then the people, the minor kings, and the ministers, who had no compassion, no nobility, and no gratitude, said, ‘He has been stupid and foolish.

source: ཡན་ལག་ཐམས་ཅད་གཏུབས་ཤིང་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཉམས་པ་ཡིན་པས་ནད་ཤ་སྣ་གུ་འདི་ཅི་དགོས་ཞེས་ཟེར་ཏེ་དེ་དག་གིས་ང་ཁྱེར་ནས་གྲོང་ཁྱེར་གྱི་ཕྱི་རོལ་དུར་ཁྲོད་ཀྱི་སར་བོར་ཏེ་དོང་ངོ་།
en: He has cut off his limbs and lost all his power over the kingdom. What use is this lump of flesh to us?’ “Then they took me outside the city and threw me into a charnel ground.

source: །དེར་ཤ་སྦྲང་དང་། སྦྲང་བུ་མཆུ་རིངས་དག་ལྷགས་ནས་ཁྲག་འཇིབ་པར་བྱེད་དོ།
en: There, flies and mosquitoes arrived and sucked my blood.

source: །ཁྱི་དང་། ཝ་དང་། བྱ་རྒོད་དག་ཀྱང་ལྷགས་ཏེ་ཤ་འཐོག་པར་བྱེད་དོ།
en: Dogs, jackals, and vultures arrived and devoured my flesh. “

source: །དེ་ནས་ངས་སེམས་རབ་ཏུ་དང་བས་སྨོན་ལམ་བཏབ་པ། གང་གི་ཚེ་བདག་གིས་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཐམས་ཅད་ཡོངས་སུ་བཏང་བ་དང་། ལུས་དང་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་བཏང་བ་ན་སྐད་ཅིག་གཅིག་ཙམ་ཡང་བདག་གིས་སེམས་འགྱོད་པར་མ་གྱུར་ཅིང་ཁྲོ་བ་མ་སྐྱེས་པ་ལྟ་ན།
en: With my mind filled with delight, I prayed, ‘When I gave away all my power over the kingdom, and gave away my body, my limbs, and my small parts, I did not have a moment’s regret or anger.

source: དེའི་ཕྱིར་བདག་གི་རེ་བ་འདི་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: Therefore, may my aspiration be fulfilled.

source: བདག་གི་ལུས་འདི་ཤའི་རིར་ཀུན་དུ་གནས་པར་གྱུར་ལ་སེམས་ཅན་གང་སུ་དག་ཤ་ཟ་བ་དང་། ཁྲག་འཐུང་བ་དེ་དག་བདག་གི་ཤ་ཟ་བར་གྱུར་ཅིག །ཁྲག་འཐུང་བར་གྱུར་ཅིག །
en: May my body remain as a mountain of flesh and may any being that eats flesh and drinks blood, eat my flesh and drink my blood.’ “

source: ཇི་སྲིད་དུ་སེམས་ཅན་རྣམས་ཤ་ཟ་བར་འགྱུར་བ་དང་། ཁྲག་འཐུང་བར་འགྱུར་བ་དེ་སྲིད་དུ་བདག་གི་སྨོན་ལམ་གྱི་དབང་གིས་ལུས་མཐར་གྱིས་སྐྱེ་བར་འགྱུར་ཞིང་། ལུས་ཀྱི་འཕང་དུ་ནི་དཔག་ཚད་འབུམ་ཡོད་པར་གྱུར་ལ། ཁྱོན་དུ་ནི་དཔག་ཚད་ལྔ་སྟོང་ཡོད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་སྟེ།
en: Through the power of my prayer, for as long as beings ate my flesh and drank my blood, my body increased in size, until it eventually became a hundred thousand yojanas in height and five thousand yojanas wide.

source: དེར་ངས་ལོ་སྟོང་གི་བར་དུ་རང་གི་ཤ་དང་ཁྲག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་སོ། །དེར་ངས་ལྕེ་ཇི་སྙེད་ཡོངས་སུ་བཏང་སྟེ།
en: For a thousand years I satisfied beings with my flesh and blood.

source: གཅན་གཟན་དང་བྱ་དག་གིས་ཡོངས་སུ་ཟོས་ནས།
en: No matter how many tongues I grew, they were eaten by animals and birds, but through the power of my prayer I always grew more.

source: ཡང་སྨོན་ལམ་གྱི་དབང་གིས་གཞན་དང་གཞན་དག་ཕྱིར་སྐྱེས་པར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་གི་ཕུང་པོ་ཡང་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདིའི་ཚད་ཙམ་དུ་གྱུར་ཏེ།
en: If they were heaped together, they would be the size of this Vulture Peak Mountain.

source: ལྗགས་ཤིན་ཏུ་རིང་བའི་མཚན་བླ་ན་མེད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ངས་སྨོན་ལམ་ཡང་རྟག་ཏུ་བཏབ་བོ།
en: I prayed to attain the unsurpassable sign of a very long tongue. “

source: །དེ་ནས་ང་ཤི་འཕོས་ནས་སྨོན་ལམ་གྱི་དབང་གིས་འཛམ་བུའི་གླིང་ཤིང་པ་ཏ་སྐྱེ་བར་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ་ཀླུའི་རྒྱལ་པོ་གཏེར་སྟོན་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Then when I died, through the power of my prayer I was reborn in the Jambudvīpa called Rūḍhavaḍa among the nāgas and I became a nāga king named Nidhisaṃdarśana.

source: །གང་གི་ནུབ་མོ་ཀླུ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་དེ་ཉིད་ཀྱི་ནུབ་མོ་ངས་དེར་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་ཀུན་ཏུ་བསྟན་ནས་ང་ཉིད་ཀྱིས་སྒྲ་བསྒྲགས་པ། ཀྱེ་སེམས་ཅན་དག་ཕྱོགས་འདི་ནི་འདི་ལྟ་སྟེ།
en: On the night I was born among the nāgas, on that very night, I revealed hundreds of millions of trillions of treasures, declaring, ‘O beings! In this place a treasure has appeared!

source: དབྱིག་དང་། གསེར་དང་། ཆུ་འདང་གི་བར་གྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བའི་གཏེར་དག་ཡོད་ཀྱིས།
en: It is filled with various precious things: gold coins, and so on, up to and including bluestones.

source: ཀྱེ་སེམས་ཅན་དག་ཁྱེད་ཀྱིས་ལོང་ཤིག །
en: O beings, take it.

source: བླངས་ནས་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་ཟུང་ཤིག །
en: When you have taken it, obtain the path of the ten good actions.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་སེམས་སྐྱེད་ཅིག །
en: Develop the aspiration for the highest, most complete enlightenment.

source: ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའམ། སངས་རྒྱས་ཀྱི་ཐེག་པར་ཡང་སེམས་སྐྱེད་ཅིག །
en: Develop the aspiration for the Śrāvakayāna, the Pratyekabuddhayāna, or the Buddhayāna.

source: དེ་ང་ལས་རིན་པོ་ཆེ་ཇི་ཙམ་དགོས་པ་དག་ལོང་ཤིག་ཅེས་ཀྱང་བསྒོ་སྟེ།
en: Go and take however many jewels you need.’ “

source: འཛམ་བུའི་གླིང་ཤིང་པ་ཏ་སྐྱེ་བ་དེར་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་ཀླུའི་སྐྱེ་བ་ལན་བདུན་བརྗེས་པ་ན།
en: In that Jambudvīpa called Rūḍhavaḍa, through the power of my previous prayer I was reborn as a nāga seven times.

source: ལོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་གྱི་བར་དུ་གཏེར་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བསྟན་ཅིང་རབ་ཏུ་བྱིན་ནོ།
en: For seventy-seven times one hundred thousand million trillion years I revealed and gave away countless, innumerable treasures. “

source: །དེ་བཞིན་དུ་དེར་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་ལ་བཙུད་ཅིང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་རབ་ཏུ་བཀོད་དེ།
en: In that same way, I brought countless, innumerable beings into the three yānas and established them on the path of the ten good actions.

source: རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་ཚིམ་པར་བྱས་ནས། བླ་ན་མེད་པའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཐོབ་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་ཡང་བཏབ་བོ།
en: I satisfied them with a variety of jewels and prayed to obtain the unsurpassable thirty-two signs of a great being. “

source: །དེ་བཞིན་དུ་གླིང་གཉིས་པར་ཡང་ཀླུའི་སྐྱེ་བ་ལན་བདུན་བརྗེས་ཏེ་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་སོ།
en: In the same way I was reborn seven times in a second continent and performed those heroic deeds.

source: །དེ་བཞིན་དུ་གླིང་གསུམ་པ་ནས་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་རྒྱལ་སྒྲ་དབྱངས་ཐམས་ཅད་ཀྱི་གླིང་ཀུན་གྱི་བར་དུ་ཡང་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་སོ།
en: In the same way, I was reborn in a third continent, and so on, until I had done the same heroic deeds in all the continents in the realm Vijitaghoṣa. “

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་གླིང་རེ་རེར་ཡང་སྔར་ཇི་སྐད་སྨོས་པའི་བར་བཞིན་དུ་ངས་ཀླུའི་སྐྱེ་བ་དེ་ལྟ་བུ་ལན་བདུན་བདུན་བླངས་ཤིང་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་བདུན་དུ་སེམས་ཅན་རྣམས་ལ་གཏེར་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དེ་ལྟ་བུ་དག་བསྟན་ཅིང་རབ་ཏུ་བྱིན་ནོ།
en: In the same way, as previously described, I was reborn as a nāga seven times in each continent within the buddha realms in the ten directions that have the five degeneracies, which are as numerous as the grains of sand in the Ganges River, and each time, for seventy-seven hundred million trillion years, I revealed and gave away countless, innumerable treasures to beings. “Observe, noble son, the Tathāgata’s bodhisattva conduct.

source: །རིགས་ཀྱི་བུ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་སྟོབས་དང་བརྩོན་འགྲུས་ཤིན་ཏུ་དྲག་པོས་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོངས་སུ་ཚོལ་བ་ན་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ལྟར། སྔར་ཇི་སྐད་སྨོས་པའི་སྐྱེས་བུ་དམ་པ་བརྒྱད་པོ་དེ་དག་མ་གཏོགས་པར་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཀྱང་སྟོབས་དང་བརྩོན་འགྲུས་ཤིན་ཏུ་དྲག་པོ་དེ་ལྟ་བུས་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་མ་སྤྱད་ཅིང་། ད་ལྟར་ཡང་སུ་ཡང་མི་སྤྱོད་ལ། ཕྱིས་འབྱུང་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་འགའ་ཡང་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི་ཤུགས་དེ་ལྟ་བུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པར་མི་འགྱུར་བའི་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ལ་ལྟོས།
en: The Tathāgata’s practice of bodhisattva conduct with powerful strength and diligence in seeking to attain the thirty-two signs of a great being is such that there has never before been a bodhisattva who practiced bodhisattva conduct with such powerful strength and diligence; there isn’t one now, nor will there be in the future such a bodhisattva who practices bodhisattva conduct with the force of such powerful strength and diligence in order to attain the highest enlightenment—that is, apart from the previously mentioned eight bodhisattvas. “

source: དེའི་ཚེ་བསྐལ་པ་གྲངས་མེད་པ་འདས་ནས་དུས་ངན་པའི་ཚེ་བསྐལ་པ་ཆེན་པོ་ཨུད་པ་ལ་ཞེས་བྱ་བ་བྱུང་བ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་བྱི་རུ་འབྱུང་བ་ཞེས་བྱ་བ་སྟོང་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་གྱུར་པའི་ཚེ།
en: Many countless eons after that time, during a bad age, in the great Utpala eon, this buddha realm had the name Pravāḍodupānā. It was empty and had the five degeneracies.

source: གླིང་བཞི་པ་དེར་ང་བརྒྱ་བྱིན་ལེགས་པར་རྣམ་པར་བྱེད་ཅེས་བྱ་བར་གྱུར་ནས་ངས་འཛམ་བུའི་གླིང་དེ་ན་སེམས་ཅན་རྣམས་མི་དགེ་བ་ལ་དད་ཅིང་སྤྱོད་པར་མཐོང་ངོ་།
en: In that world of four continents I was born as a Śakra named Savirocana. “I saw that the beings in that Jambudvīpa believed in and practiced bad actions.

source: །མཐོང་ནས་ཀྱང་ངས་བདག་ཉིད་གནོད་སྦྱིན་གྱི་གཟུགས་ཤིན་ཏུ་འཇིགས་འཇིགས་ལྟ་ཞིག་ཏུ་མངོན་པར་སྤྲུལ་ཏེ། འཛམ་བུའི་གླིང་དུ་བབས་ནས་མི་རྣམས་ཀྱི་མདུན་དུ་འདུག་གོ།
en: I transformed myself into the form of an extremely fierce yakṣa, descended to Jambudvīpa, and came before them.

source: །དེ་དག་གིས་ང་མཐོང་ནས་སྐྲག་སྟེ་ང་ལ་དྲིས་པ།
en: When they saw me, they were terrified and asked, ‘What do you want?

source: ཁྱོད་ལ་ཅི་དགོས་བདག་ཅག་གིས་ཁྱོད་ལ་དབུལ་བར་བགྱིའོ།
en: We will give it to you!’ “

source: །ངས་སྨྲས་པ། ཁོ་བོ་ལ་ཁ་ཟས་དག་དགོས་སོ། །དེ་དག་གིས་སྨྲས་པ།
en: I said, ‘I need food.’ “ ‘

source: ཁྱོད་ཀྱི་ཁ་ཟས་ཇི་ལྟ་བུ་ལགས།
en: What kind of food?’

source: ངས་སྨྲས་པ།
en: they asked. “

source: ཁོ་བོ་ནི་མི་དག་བསད་ཅིང་ཟ་སྟེ།
en: I said, ‘I kill and eat people.

source: མི་གང་དག་ཇི་སྲིད་འཚོའི་བར་དུ་སྲོག་གཅོད་པ་སྤོང་བར་བྱེད་པ་དང་། ལོག་པར་ལྟ་བའི་བར་དག་སྤོང་བར་བྱེད་པ་དེ་དག་ལ་ནི་ང་མི་ཟའོ།
en: But I don’t eat people who have given up killing for the rest of their lives and those who have renounced bad views.

source: །གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པར་སེམས་སྐྱེད་པར་བྱེད་པ་དེ་དག་ལ་ཡང་ང་མི་ཟའོ་ཞེས་སྨྲས་ཏེ།
en: I don’t eat those who have developed the aspiration for the highest, most complete enlightenment or those who have developed the aspiration for the Śrāvakayāna and the Pratyekabuddhayāna.’ “

source: དེ་ན་ང་སེམས་ཅན་དག་སྤྲུལ་ཞིང་ཟ་བ་དེ་མཐོང་བ་ན།
en: Then I emanated beings, whom I ate.

source: སེམས་ཅན་དེ་དག་འཇིགས་པས་ཇི་སྲིད་འཚོ་བའི་བར་དུ་སྲོག་གཅོད་པ་སྤངས་སོ། །མ་བྱིན་པར་ལེན་པ་དང་། ལོག་པར་ལྟ་བའི་བར་དག་ཀྱང་སྤངས་སོ།
en: When the beings saw me do so, they were terrified and renounced for the rest of their lives killing, taking what has not been given, and so on, up to and including bad views.

source: །ཁ་ཅིག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །ཁ་ཅིག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར། ཁ་ཅིག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པར་སེམས་བསྐྱེད་དེ།
en: Some developed the aspiration for the highest, most complete enlightenment; some developed the aspiration for the Śrāvakayāna; and some developed the aspiration for the Pratyekabuddhayāna.

source: གླིང་བཞི་པའི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ཐེག་པ་གསུམ་པོ་དག་ལ་རབ་ཏུ་བཀོད་ནས་དེར་ངས་སྨོན་ལམ་བཏབ་པ།
en: I established all the beings in the four continents on the path of the ten good actions and the three yānas. “

source: གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་ཕྱིར་བདག་གིས་སྨོན་ལམ་འདི་ཡང་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: I prayed, ‘If my aspiration for the highest, most complete enlightenment will be fulfilled, then may this prayer of mine be fulfilled.

source: ཇི་ལྟར་བདག་གིས་གླིང་བཞི་པའི་སེམས་ཅན་རྣམས་དགེ་བའི་ལམ་རྣམས་ལ་ངེས་པར་སྦྱར་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པ་ཀུན་གྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་ལྟ་བུའི་འཇིགས་པས་བདག་མཐོང་བར་འགྱུར་བ་དང་། བདག་གིས་ཀྱང་སེམས་ཅན་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་ཅིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་ངེས་པར་སྦྱོར་བར་གྱུར་ཅིག །
en: Just as I have brought the beings of these four continents onto the path of good actions, so may I terrify, when they see me, all beings in all the four-continent worlds in this buddha realm and may I place those beings on the path of the ten good actions and bring them into the three yānas.

source: དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དག་གི་སེམས་ཅན་ཐམས་ཅད་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་ཅིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་ངེས་པར་སྦྱོར་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: In the same way, may I place on the path of the ten good actions and bring into the three yānas all the beings within the empty buddha realms with the five degeneracies in the ten directions, which are as numerous as the grains of sand in the Ganges River.’ “

source: །རིགས་ཀྱི་བུ་ངའི་རེ་བ་དང་སྨོན་ལམ་དེ་བཞིན་དུ་ཡོངས་སུ་རྫོགས་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་བྱི་རུ་འབྱུང་བ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་གནོད་སྦྱིན་གྱི་གཟུགས་ཀྱིས་དགེ་བའི་ཆོས་རྣམས་ལ་ངེས་པར་བཏུལ་ཏོ།
en: Noble son, that aspiration and prayer was fulfilled. In the form of a yakṣa I guided all the humans in the Pravāḍodupānā realm into good qualities.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་སྙིགས་མ་ལྔ་དང་ལྡན་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་ངས་གནོད་སྦྱིན་གྱི་གཟུགས་ཀྱིས་མི་རྣམས་དགེ་བའི་ལམ་གྱི་སྤྱོད་པ་དག་ལ་རབ་ཏུ་བཀོད་དོ།
en: In the same way, in the form of a yakṣa I established all beings within the empty buddha realms in the ten directions, which have the five degeneracies and are as numerous as the grains of sand in the Ganges River, in the practice of the path of good actions. “

source: །དེ་ལྟར་ངས་སེམས་ཅན་མང་པོ་དག་བསྡིགས་ཤིང་དགེ་བའི་སྤྱོད་པ་ལ་རབ་ཏུ་བཀོད་པའི་ལས་ཀྱི་འཕྲོ་དེས་ན།
en: In that way, I threatened many beings and established them in the practice of good actions.

source: དེ་བར་ང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་རྡོ་རྗེའི་གདན་ལ་འདུག་པ་ན་བདུད་སྡིག་ཅན་དམག་གི་ཚོགས་ཆེན་པོ་དང་བཅས་ཏེ་ང་བྱང་ཆུབ་ལས་རྣམ་པར་བཟློག་པར་བྱ་བའི་ཕྱིར་ཉེ་བར་འོངས་པ་ཡིན་ནོ།
en: Through the power of that karma, when I sought the complete enlightenment of perfect buddhahood, and sat at the foot of the Bodhi tree in Vajrāsana, evil Māra with his great army came to prevent me from attaining enlightenment. “

source: །རིགས་ཀྱི་བུ་ངས་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོབ་པ་མདོར་བསྡུས་པ་ནི་དེ་ཡིན་ཏེ།
en: Noble son, that is a brief description of my attainment of the perfection of generosity while I was practicing the conduct of a bodhisattva.

source: དེའི་ཚེ་ངས་བཟོད་པ་ཟབ་མོ་དང་། གཟུངས་ཟབ་མོ་དང་། ཏིང་ངེ་འཛིན་ཟབ་མོ་དང་། འཇིག་རྟེན་པའི་མངོན་པར་ཤེས་པ་ལྔ་ཡང་ཐོབ་སྟེ་སྐྱེས་བུའི་རྩལ་ཆེན་པོ་དེ་ལྟ་བུ་དག་ཀྱང་བྱས་སོ།
en: During that time, I also attained profound acceptance, profound retention, profound samādhi, and the five mundane clairvoyances. I also accomplished such great heroic deeds. “

source: །དེ་བཞིན་དུ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Similarly, I made countless, innumerable beings obtain, enter, and remain in the aspiration for the highest, most complete enlightenment. “

source: །དེ་བཞིན་དུ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Similarly, I made countless, innumerable beings obtain, enter, and remain in the Pratyekabuddhayāna. “

source: །དེ་བཞིན་དུ་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཡང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Similarly, I made countless, innumerable beings obtain, enter, and remain in the Śrāvakayāna. “

source: །ངས་ཇི་སྲིད་དུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: While I was practicing the conduct of a bodhisattva I attended upon as many bhagavat buddhas as there are particles in a buddha realm.

source: ངས་སངས་རྒྱས་རེ་རེའི་དྲུང་ནས་རྒྱ་མཚོའི་ཆུའི་ཐིགས་པ་སྙེད་ཀྱི་ཡོན་ཏན་དག་ཡོངས་སུ་བཟུང་བ་མ་གཏོགས་པར་ངས་རང་སངས་རྒྱས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ལ་ཡང་མཆོད་པ་བྱས་སོ། །དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་ལ་ཡང་མཆོད་པ་བྱས་སོ།
en: From each buddha I obtained as many qualities as there are drops of water in the ocean, I made offerings to countless pratyekabuddhas, and I made offerings to countless śrāvakas of tathāgatas.

source: །དེ་བཞིན་དུ་ཕ་དང་། མ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པའི་དྲང་སྲོང་རྣམས་ལ་ཡང་མཆོད་པ་བྱས་སོ།
en: Similarly, I made offerings to fathers, mothers, and ṛṣis who had the five clairvoyances.

source: །ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྙིང་བརྩེ་བས་རང་གི་ཤ་དང་ཁྲག་གིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་ཏེ། ད་ལྟར་ཡང་རང་གི་ཆོས་རྣམས་ཀྱིས་ཚིམ་པར་བྱས་པ་ཡིན་ནོ།
en: When in the past I practiced the conduct of a bodhisattva, with compassion I satisfied beings with my own flesh and blood, and in the present, I satisfy beings through the Dharma teachings.”

source: །ཐེག་པ་ཆེན་པོའི་མདོ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ལས་སྦྱིན་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ལྔ་པའོ།། །།
en: That concludes “The Practice of Generosity,” which is the fifth chapter of the Mahāyāna sūtra titled The White Lotus of Compassion.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ངས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་ཕྱོགས་བཅུ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དག་གཟིགས་པ་དེ་དག་ཀྱང་ངས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Conclusion Chapter 6 “Noble son, I, with my buddha eyes, see in the ten directions as many bhagavat buddhas passing into parinirvāṇa as there are particles in a buddha realm.

source: །དེ་ལྟར་ངས་དང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: It was I who first brought them all to the aspiration for the highest, most complete enlightenment and made them enter and remain in it. “

source: །དེ་བཞིན་དུ་ད་ལྟར་ཤར་ཕྱོགས་ལོགས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་དག་གཟིགས་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་ངས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Thus, I see innumerable, uncountable bhagavat buddhas who reside, live, and remain in the eastern direction, teaching the Dharma, having turned the Dharma wheel that possesses the Dharma. It was I who first brought them, too, to the aspiration for the highest, most complete enlightenment and made them enter and remain in it.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གི་བར་ལ་ཡང་དེ་བཞིན་དུ་བརྗོད་པར་བྱའོ།
en: I was the one who made them first obtain, enter, and remain in the six perfections. “

source: །དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་རྣམས་སུ་ཡང་བརྗོད་པར་བྱའོ།
en: I can say the same for the south, the west, and the north, below, and above. “

source: །རིགས་ཀྱི་བུ་ངས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ས་ཡ་ཕྲག་དགུ་དང་ཆིག་འབུམ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཀུན་དུ་རྒྱས་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་གཟིགས་ཏེ།
en: Noble son, I see in the eastern direction from this buddha realm, beyond 9,100,000 buddha realms, a realm called Saṃpuṣpita. The tathāgata named Vimalateja­guṇa­rāja resides, lives, and remains there, teaching the Dharma.

source: བཅོམ་ལྡན་འདས་དེ་ཡང་ངས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཞག་སྟེ་རབ་ཏུ་གནས་པར་བྱས་སོ།
en: I was the one who made that bhagavat develop for the first time the aspiration for the highest, most complete enlightenment and first obtain, enter, and remain in it.
